Revit 2027 API
FabricationPartSizeMap Constructor
Overload List
Name | Description
FabricationPartSizeMap(String, Double, Double, Boolean) |  Creates a new instance of the FabricationPartSizeMap class.
FabricationPartSizeMap(String, Double, Double, Boolean, ConnectorProfileType, Int32, Int32) |  Creates a new instance of the FabricationPartSizeMap class.
Top
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace